{
  "education": [
    {
      "awards_achievements": [
        "Dean's List (2020)",
        "GPA: 3.6/4.0"
      ],
      "degree": "Post Graduate Diploma Certificate",
      "department": "Computer Software and Database Development",
      "duration": "2020-2021",
      "school_name": "Lambton College"
    },
    {
      "awards_achievements": [
        "Graduated in first division"
      ],
      "degree": "Bachlors of Technology",
      "department": "Computer Engineering and Management",
      "duration": "2013-2017",
      "school_name": "College of Engineering and Management"
    }
  ],
  "github_repo_root_url": "https://github.com/Jarvis-Consulting-Group/jarvis_data_eng-lovepreet212",
  "highlighted_projects": [
    {
      "description": "Developed a website for searching and calling handymen in the nearby area based on the problem. The tools and languages used in this project are J2EE, Tomcat server,mySql, HTML,CSS, Java Script, JDBC-ODBC driver.",
      "git_url": "https://github.com/jarviscanada/jarvis_profile_builder",
      "name": "Website for handyman services"
    }
  ],
  "jarvis_projects": [
    {
      "description": "This is a Linux-based project designed to record the hardware specifications and resource usage of each computer in a cluster. Its purpose is to make it easier for the administration team to perform load balancing, detect failures, or compensate for server failures. The application uses Bash scripts to gather hardware information and resource usage by the host computer, and a PostgreSQL database is run in a Docker container to persist the data obtained from each computer. The project automates every minute using crontab to allow continuous monitoring.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "JDBC App:This project showcases the usage of JDBC to establish connections between Java applications and Database Management Systems, utilizing Data Access Patterns. The project implements DAO to perform CRUD operations and achieve abstraction between the business and persistence layers. The IntelliJ IDE is used for development, and the Maven tool is for building, compiling, and managing dependencies in the application. A Docker container is used to run the PostgreSQL database, allowing operations on the data.",
        "Grep App: The Grep Application is a project used to search for the specified file(s) in a given directory for lines containing the specified pattern and write the matching lines to an output file. This application is designed in two ways: one using a regular list collection and the other using Stream and lambda expressions. It uses IntelliJ to develop the application and the Java programming language. The Maven tool is used to build and manage dependencies such as the SLF4J logger. Docker is used to deploy the project on Docker Hub to make it easily accessible to other users. The application is tested using the inbuilt debugger available in the IDE."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Lovepreet Kaur",
  "others": [
    {
      "bullets": [
        "Playing Badminton",
        "Dancing"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Donec mattis sed justo et sagittis. Vestibulum lacinia nulla ipsum. Curabitur imperdiet nibh vitae leo lacinia laoreet. Nullam accumsan, lectus ut maximus ultricies, augue justo egestas mi, vel bibendum felis.",
      "duration": "2020-present",
      "title": "Software Developer"
    },
    {
      "company": "LetsStopAids",
      "description": "Developed a Mobile Application to store details of volunteers for the management. The tools and SDLC used in the development are Android Studio, JAVA, Firebase Console, and Agile Framework. Android studio was used to develop the front and back end, the firebase console was used to store data, and the project development followed the agile process.",
      "duration": "2021-2021",
      "title": "Mobile Application Developer"
    }
  ],
  "skills": {
    "competent": [
      "HTML",
      "CSS",
      "JDBC",
      "Maven",
      "Firebase Console"
    ],
    "familiar": [
      "Python",
      "Repository Patterns",
      "Node Js",
      "React Native",
      "Javascript"
    ],
    "proficient": [
      "Java",
      "Bash scripts",
      "SQL",
      "Agile/Scrum",
      "Docker"
    ]
  },
  "summary": "I graduated from Lambton College with a Postgraduate Certification in Computer Software and Database Development. Before that, I completed my Bachelor's degree in Computer Science Engineering in India. During my degree, I learned to develop mobile and web applications using languages like Java and markup languages like HTML, CSS, and JavaScript. While studying, I volunteered for Let's Stop AIDS Organization, where I developed an Android mobile application using Java and Firebase to record volunteer profiles, timesheets, and availability for volunteering. Currently, I am working at Jarvis Consulting Group as a software developer. I am passionate about evolving technologies and improving my coding skills. From my perspective, coding brings new challenges every day, and that's what I enjoy about it. I like to solve errors and spend my time developing new applications using various tools and technologies. I pay attention to details and enjoy working as part of a team to solve specific problems. I am looking for an opportunity to kick start my career and thrive with my strong adaptability and leadership skills in this field."
}
