{
  "education": [
    {
      "awards_achievements": [
        "Dean's List (2020)",
        "GPA: 3.6/4.0"
      ],
      "degree": "Post Graduate Diploma Certificate",
      "department": "Computer Software and Database Development",
      "duration": "2020-2021",
      "school_name": "Lambton College"
    },
    {
      "awards_achievements": [
        "Graduated in first division"
      ],
      "degree": "Bachlors of Technology",
      "department": "Computer Engineering and Management",
      "duration": "2013-2017",
      "school_name": "College of Engineering and Management"
    }
  ],
  "github_repo_root_url": "https://github.com/Jarvis-Consulting-Group/jarvis_data_eng-lovepreet212",
  "highlighted_projects": [
    {
      "description": "This project involves the development of a website that enables users to search for and contact handymen located in their vicinity based on the problem they need help with. The project was developed using J2EE technology and utilizes the Tomcat server to run the application. A mySQL database is used to store information about handymen and their services, which is queried using the JDBC-ODBC driver. HTML, CSS, and JavaScript are utilized to create an intuitive and user-friendly interface that allows for easy searching and communication with handymen. Overall, this project showcases the integration of multiple technologies to create a functional and efficient web application for solving real-world problems.",
      "name": "Website for handyman services"
    }
  ],
  "jarvis_projects": [
    {
      "description": "This project is centered around a Linux-based system that aims to track the hardware specifications and resource usage of individual computers within a cluster. The primary objective is to simplify the load balancing process, detect failures, and provide a means to compensate for server failures for the administration team. To achieve this, the application utilizes Bash scripts to collect information about the host computer's hardware and resource usage, while a PostgreSQL database is utilized within a Docker container to store the obtained data. Furthermore, the project is designed to automate the monitoring process every minute using crontab, ensuring continuous and uninterrupted observation.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App:This project is built around the Twitter REST API, which allows users to post, read, and update tweets on Twitter. The application is designed using the Model-View-Controller (MVC) architecture, with models and controllers playing a significant role in the project's construction. The application uses several libraries, such as Jackson for converting objects to strings and vice versa, Mockito for unit testing, JUnit for integration testing, and Apache HttpClient4 for client-server interaction.The Spring Framework and Spring Boot are also used to manage dependencies in the project.Finally, the project is containerized using Docker, making it easy to deploy and use in various environments.",
        "JDBC App:This project illustrates the application of JDBC to establish connections between Java applications and Database Management Systems, utilizing Data Access Patterns. The implementation incorporates the use of DAO to perform CRUD (Create, Read, Update, Delete) operations and abstract the business and persistence layers. Development is carried out using the IntelliJ IDE, and the Maven tool is used to build, compile, and manage dependencies in the application. Furthermore, the PostgreSQL database is run in a Docker container to enable manipulation of data.",
        "Grep App:The Grep Application is a project that serves to search for specific files in a directory for lines that contain a defined pattern, and write the matched lines to an output file. There are two versions of this application: one is built using a regular list collection, and the other is implemented using Stream and lambda expressions. Development of the application takes place in IntelliJ utilizing the Java programming language. The Maven tool is utilized for dependency management and building, with the SLF4J logger being an example of a dependency employed. In addition, Docker is used to deploy the project on Docker Hub, allowing for ease of access for other users. The IDE's inbuilt debugger is utilized for testing purposes."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Lovepreet Kaur",
  "others": [
    {
      "bullets": [
        "Playing Badminton",
        "Dancing"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "I worked on various data-related projects that involved using Linux, Bash scripting, Docker containers, PostgreSQL databases, and Java programming. In these projects, I followed the Scrum agile methodology and used Git version control and Git Flow for code management. Additionally, I provided support to my team members and assisted them in resolving project-related issues.",
      "duration": "2023-present",
      "title": "Software Developer"
    },
    {
      "company": "LetsStopAids",
      "description": "I developed a mobile application for volunteer management. The application stores details of volunteers and manages their schedules. The application was developed using Android Studio for the front and back end. Java was used as the primary programming language, and the Firebase console was used for data storage. The Agile Framework was followed during the development process, and the application was developed in iterations. The development process involved close collaboration with the stakeholders to ensure the application met their requirements.",
      "duration": "2020-2021",
      "title": "Mobile Application Developer"
    }
  ],
  "skills": {
    "competent": [
      "HTML",
      "SQL",
      "JDBC",
      "Maven",
      "Firebase Console"
    ],
    "familiar": [
      "Python",
      "Repository Patterns",
      "Node Js",
      "React Native",
      "MVC"
    ],
    "proficient": [
      "Java",
      "Bash",
      "Spring Framework",
      "REST API's",
      "Docker"
    ]
  },
  "summary": "I attained a Postgraduate Certification in Computer Software and Database Development from Lambton College, following the completion of my Bachelor's degree in Computer Science Engineering from India. Throughout my academic journey, I acquired the skills to develop mobile and web applications using Java, HTML, CSS, and JavaScript. While pursuing my studies, I also volunteered for Let's Stop AIDS Organization, where I developed an Android mobile application, utilizing Java and Firebase, to facilitate the recording of volunteer profiles, timesheets, and availability for volunteering.Presently, I work as a software developer at Jarvis Consulting Group and possess a deep passion for emerging technologies and honing my coding skills. I relish the challenges that programming presents on a daily basis and derive immense satisfaction from troubleshooting issues and creating novel applications using diverse tools and technologies. My meticulous attention to detail, coupled with my enthusiasm for teamwork, enables me to solve complex problems effectively. I am eager to kick-start my career and leverage my adaptability and leadership abilities to thrive in this dynamic field."
}
